import serial as pyserial


class SerialConfig:

    # #########################################################################################
    # 시리얼포트
    # #########################################################################################
    BAUDRATES = (
        1200,
        2400,
        4800,
        9600,
        19200,
        38400,
        57600,
        115200,
    )
    # #########################################################################################
    # 데이터 비트(default:3)
    # #########################################################################################
    DATABITS = (
        pyserial.FIVEBITS,
        pyserial.SIXBITS,
        pyserial.SEVENBITS,
        pyserial.EIGHTBITS,
    )
    # #########################################################################################
    # PARITY (default:0)
    # #########################################################################################
    PARITY = (
        pyserial.PARITY_NONE,
        pyserial.PARITY_EVEN,
        pyserial.PARITY_ODD,
        pyserial.PARITY_SPACE,
        pyserial.PARITY_MARK,
        pyserial.PARITY_NAMES,
    )
    # #########################################################################################
    # STOP BITS (default:0)
    # #########################################################################################
    STOPBITS = (
        pyserial.STOPBITS_ONE,
        pyserial.STOPBITS_ONE_POINT_FIVE,
        pyserial.STOPBITS_TWO
    )

    # #########################################################################################
    # 시리얼 접속 정보 설정
    # #########################################################################################
    @staticmethod
    def get_serial_info():
        serial_info = {
            "port_name": "",
            "baud_rate": "",
            "data_bits": "",
            "parity": "",
            "stop_bits": "",
            "timeout": 0,
            "write_timeout": 3,
            "xonxoff": False,
            "rtscts": False,
            "dsrdtr": False
        }
        return serial_info

    # #########################################################################################
    # Drone Widget 으로 보내지는 기본 데이터 패킷
    # #########################################################################################
    @staticmethod
    def get_send_drone_data():

        drone_data = {
            "controller": "",
            "type": "",
            "status": "",
            "port": "",
            "baud": "",
            "icon": "",
            "ip_address": ""
        }
        return drone_data

    # #########################################################################################
    # Hud Widget 으로 보내지는 기본 데이터 패킷
    # #########################################################################################
    @staticmethod
    def get_send_hud_data():

        hud_data = {
            "roll": "",
            "pitch": "",
            "heading": ""
        }
        return hud_data

    # #########################################################################################
    # Gps Widget 으로 보내지는 기본 데이터 패킷
    # #########################################################################################
    @staticmethod
    def get_send_gps_data():

        gps_data = {
            "fix": "",
            "count": "",
            "alt": "",
            "lat": "",
            "lng": "",
            "hdop": "",
            "vdop": ""
        }
        return gps_data

    # #########################################################################################
    # Status Widget 으로 보내지는 기본 데이터 패킷
    # #########################################################################################
    @staticmethod
    def get_send_status_data():

        status_data = {
            "mode": "",
            "arming": "",
            "battery_volt": "",
            "battery_remain": "",
            "current_mission": "",
        }
        return status_data

    # ##########################################################################################
    # map Widget 으로 보내지는 기본 데이터 패킷
    # ##########################################################################################
    @staticmethod
    def get_send_map_data():

        map_data = {
            "lat": "",
            "lon": "",
            "heading": "",
            "type": "",
        }
        return map_data

